    .data
.org             0x40                        ; С 0x00 до 0x3F включительно расположен буфер!!!
input_addr:      .word  0x80
output_addr:     .word  0x84

    .text
    .org     0x88
_start:
    movea.l  input_addr, A0                  ; Регистр A0 содержит адрес ячейки, в которой лежит 0x80
    movea.l  (A0), A0                        ; Записываем в регистр A0 содержимое ячейки, адрес которой сейчас в A0 (A1 <- 0x80)

    movea.l  output_addr, A1
    movea.l  (A1), A1                        ; Регистр A1 <- 0x84

    movea.l  0x00, A2                        ; Регистр А2 хранит адрес начала буфера

    movea.l  0x1000, A7                      ; Регистр A7 выступает в качестве SP, указывает на последнюю ячейку памяти
    movea.l  0xFFF8, A6                      ; Устанавливаем изначальное значение FP

    ; A0 -- адрес ячейки ввода
    ; A1 -- адрес ячейки вывода
    ; A2 -- адрес буфера (динамически изменяющийся указатель)
    ; A4 -- специальный адресный указатель на мини-стек для сравнения адресов
    ; A6 -- frame pointer, который указывает на самое начало фрейма (FP)
    ; A7 -- указатель стека, указыващий на вершину фрейма (SP)
    ; D5 -- счётчик фрейма стека, указывающий на количество элементов в нём
    ; D7 -- счётчик для отслеживания переполнения до вызова error_symbol

    jsr      infix_to_rpn                    ; Вызов основной процедуры (после возврата из данной функции PC будет указывать как раз на метку end)

end:
    halt                                     ; Останов.

    ; Основная процедура
infix_to_rpn:
    link     A6, -64                         ; Выделяем фрейм стека для локальных переменных, там мы будем хранить символы операций и скобки (аналог стека ops)

    jsr      read_line_function              ; Вызов процедуры read_line_function
    jsr      print_line_function             ; Вызов процедуры print_line_function

    unlk     A6                              ; Уничтожение фрейма стека для данной процедуры
    rts                                      ; Возврат из процедуры infix_to_rpn

    ; Функция, читающая строку и формрующая буфер
read_line_function:
    movea.l  A6, A3                          ; Регистр A3 будем использовать как динамический указатель на фрейм стека (изначально устанавливаем его на самый низ)
    clr.l    D5                              ; Очищаем регистр D5 от мусора, чтобы корректно использовать в качестве счётчика элементов на стеке
    clr.l    D0                              ; Очищаем регистр D0, который будет использован для промежуточного хранения каждого символа
    clr.l    D1                              ; Регистр D1 выступает в качестве счётчика
    clr.l    D6                              ; Регистр D6 хранит 1, если последний записанный символ в буфер - цифра (для корректного отображения чисел, а не только цифр)
    clr.l    D7
read_line_loop:
    cmp.l    64, D7                          ; Первым делом необходимо проверить не было ли переполнения при помощи регистра D7
    bge      overflow_error                  ; Если D7 >= 64 - ошибка переполнения!!!

    move.b   (A0), D0                        ; Читаем символ -> кладём байт в регистр D0
    add.l    1, D7                           ; +1 к количеству считанных символов

    cmp.b    0x30, D0                        ; Если символ меньше ASCII-кода символа '0' -> переход
    blt      not_digit
    cmp.b    0x39, D0                        ; Если символ больше ASCII-кода символа '9' -> тоже переход
    bgt      not_digit

    move.b   D0, (A2)+                       ; Раз символ оказался цифрой, пишем его сразу в буфер
    add.l    1, D1                           ; +1 к счётчику
    move.l   1, D6                           ; Выставляем единицу в регистре D6
    jmp      read_line_loop                  ; Читаем символы дальше

not_digit:
    cmp.l    0, D6                           ; Если попалась не цифра, и до этого пришла тоже не цифра, переходим к обработке других символов
    beq      after_close
    move.b   0x20, (A2)+                     ; Иначе пишем пробел в буфер
    add.l    1, D1
    clr.l    D6
after_close:
    cmp.b    0x0A, D0                        ; Сравниваем прочитанный символ с '\n'
    beq      end_of_line                     ; Если перенос строки, то выходим из цикла чтения

    cmp.b    0x20, D0                        ; Если встретили пробел - пропускаем, переходим на следующую итерацию цикла
    beq      read_line_loop

    cmp.b    0x28, D0
    beq      handle_left_bracket             ; Переход, если символ '('

    cmp.b    0x29, D0
    beq      handle_right_bracket            ; Переход, если символ ')'

    cmp.b    0x2D, D0                        ; Переход к обработке символа операции, если встретили '+', '-', '*' или '/'
    beq      op_symbol
    cmp.b    0x2B, D0
    beq      op_symbol
    cmp.b    0x2A, D0
    beq      op_symbol
    cmp.b    0x2F, D0
    beq      op_symbol

    jmp      error_symbol

handle_left_bracket:
    move.b   D0, -(A3)                       ; Кладём на вершину стека '('
    add.l    1, D5                           ; +1 к количеству элементов в фрейме стека
    jmp      read_line_loop                  ; Читаем дальше символы из входной строки

handle_right_bracket:
    cmp.l    0, D5                           ; Если стек пустой, то возвращаем ошибку, так как не нашлось '('
    beq      error_symbol

    move.b   (A3)+, D0                       ; Достаём верхний элемент со стека в регистр A6, сдвигаем указатель (ops.pop())
    sub.l    1, D5                           ; -1 к количеству элементов в куске стека

    cmp.b    0x28, D0                        ; Если верхний элемент - это символ '(', то выходим из цикла
    beq      read_line_loop                  ; Идём читать следующий символ

    ; Если оказалось что стек еще не пустой и последний элемент на стеке не '('
    move.b   D0, (A2)+                       ; Записываем прочитанный символ + пробел в буфер
    move.b   0x20, (A2)+

    add.l    0x02, D1
    jmp      handle_right_bracket

op_symbol:
    ; Определяем приоритет текущего символа, используя для его хранения регистр D2
    move.l   0x01, D2                        ; По умолчанию присваиваем приоритет 1
    cmp.b    0x2A, D0                        ; Если символ '*' или '/' переходим к установке приоритета 2
    beq      set_priority2
    cmp.b    0x2F, D0
    beq      set_priority2

    jmp      check_ops
set_priority2:
    move.l   0x02, D2

check_ops:
    cmp.l    0, D5                           ; Если стек пустой (указатель A3 = A6), то кладём на стек символ
    beq      push_curr_op

    move.b   (A3), D3                        ; Загружаем последний символ стека в регистр D3

    cmp.b    0x28, D3                        ; Если верхний символ на стеке '(', то просто кладём на стек символ
    beq      push_curr_op

    ; Определяем приоритет последнего символа на стеке, используя для этого регистр D4
    move.l   0x01, D4                        ; По умолчанию приоритет 1
    cmp.b    0x2A, D3
    beq      top_priority2
    cmp.b    0x2F, D3
    beq      top_priority2

    jmp      compare_with_priorities
top_priority2:
    move.l   0x02, D4                        ; Если символ '*', '/', то приоритет 2

compare_with_priorities:
    cmp.l    D2, D4                          ; Сравниваем приоритеты обоих символов
    blt      push_curr_op                    ; Если приоритет символа на стеке меньше читаемого символа, то просто пушим на стек полученный символ

    ; Иначе снимаем символ со стека и пишем его в буфер
    move.b   (A3)+, D3                       ; Берём символ с вершины стека в регистр D3 (он использован в качестве временного регистра, потом перезапишется при помощи move.b)
    sub.l    1, D5                           ; -1 к количеству элементов на стеке

    move.b   D3, (A2)+
    move.b   0x20, (A2)+

    add.l    0x02, D1
    jmp      check_ops

push_curr_op:
    move.b   D0, -(A3)
    add.l    1, D5                           ; +1 к количеству элементов в кусочке стека
    jmp      read_line_loop

    ; Строка полностью считана, остаётся доформировать буфер спец. символами из стека и null-терминатором
end_of_line:
    cmp.l    0, D5                           ; Если стек полностью прочитан (адрес A3 стал равен адресу начала фрейма стека - A6) - переходим к завершению формирования буфера
    beq      finish_buffer

    move.b   (A3)+, D3                       ; Читаем символ с вершины стека и записываем в регистр D3 (аналог ops.pop())
    sub.l    1, D5

    cmp.b    0x28, D3                        ; Если прочитан символ '(' -> возвращаем ошибку
    beq      error_symbol

    move.b   D3, (A2)+                       ; Иначе записываем в буфер считанный символ + пробел
    move.b   0x20, (A2)+

    add.l    0x02, D1
    jmp      end_of_line
finish_buffer:
    cmp.l    0, D1                           ; Если на вход не пришло символов, то переход к empty_buffer
    beq      empty_buffer
    move.b   0x00, -1(A2)                    ; Записываем в ячейку по адресу A2-1 null-терминатор, вместо пробела
    rts                                      ; Возврат из процедуры
empty_buffer:
    move.b   0x00, (A2)
    rts
    ; Вывод ошибки при несоответствии области определения
error_symbol:
    cmp.b    0x0A, D0
    beq      error_write
error_drain:                                 ; Если во входном потоке ещё остались символы, необходимо их всех прочитать по заданию
    cmp.l    64, D7
    bge      overflow_error
    move.b   (A0), D0
    add.l    1, D7
    cmp.b    0x0A, D0
    bne      error_drain
error_write:
    move.l   -1, (A1)                        ; Получив плохой символ (тот, который не входит в область определения), возвращаем -1 в качестве результата функции
    jmp      end

    ; Вывод ошибки при переполнении
overflow_error:
    move.l   0xCCCCCCCC, (A1)                ; Выводим overflow_value в output_address
    jmp      end                             ; Прыгаем к завершению программы


    ; Функция вывода сформированного буфера
print_line_function:
    clr.l    D0                              ; Очищаем регистр D0, который будет использован для промежуточного хранения каждого символа
    movea.l  0x00, A2                        ; Записываем в A2 начало сформированного буфера
print_line_loop:
    move.b   (A2)+, D0                       ; Читаем символ из буфера и записываем его в регистр D0

    cmp.b    0x00, D0                        ; Если прочитан null-терминатор => буфер полностью прочитан, можно выходить из процедуры
    beq      print_done

    move.b   D0, (A1)                        ; Выводим символ

    jmp      print_line_loop                 ; Читаем следующий символ
print_done:
    rts                                      ; Возврат из процедуры в основную функцию infix_to_rpn