    .data
input_addr:      .word  0x80
output_addr:     .word  0x84
error_value:     .word  0xCCCCCCCC         ; Значение при ошибке
shift_value:     .word  31

    .text
    .org 0x88

_start:
    ; Инициализируем указатель стека
    lui sp, %hi(0x1000)            /                                /              /
    addi sp, sp, %lo(0x1000)       /                                /              /

    ; Загружаем в регистры s1 и s2 адреса ячеек ввода и вывода соответственно
    lui s1, %hi(input_addr)        /                                /              /
    addi s1, s1, %lo(input_addr)   /                                /              /
                                   /                                / lw s1, 0(s1) /

    lui s2, %hi(output_addr)       /                                /              /
    addi s2, s2, %lo(output_addr)  /                                /              /
                                   /                                / lw s2, 0(s2) /

    ; Загружаем в регистр s3 error_value
    lui s3, %hi(error_value)       /                                /              /
    addi s3, s3, %lo(error_value)  /                                /              /
                                   /                                / lw s3, 0(s3) /

    ; Загружаем в регистр s4 shift_value
    lui s4, %hi(shift_value)       /                                /              /
    addi s4, s4, %lo(shift_value)  /                                /              /
                                   /                                / lw s4, 0(s4) /

    ; Переходим к процедуре чтения аргументов со входа, предварительно сохранив caller-saved регистр Ra на стек
    addi sp, sp, -4                /                                /              /
                                   /                                / sw ra, 0(sp) / jal ra, read_args

    ; Переход к выполнению основной функции, предварительно сохраняем прошлое значение Ra на стек (оно было сохранено как раз ещё в прошлой инструкции, т.е. можно не менять)
                                   /                                /              / jal ra, complex_multiply

    ; Восстанавливаем значение регистра Ra со стека
                                   /                                / lw ra, 0(sp) /
    addi sp, sp, 4                 /                                /              /

    ; s1 -- адрес ячейки ввода
    ; s2 -- адрес ячейки вывода
    ; s3 -- содрежит error_value
    ; s4 -- содержит константу для логического сдвига
    ; s6 -- cодержит младшие 32 бита вещественной части real
    ; s7 -- содержит младшие 32 бита мнимой части imag
    ; a0-a3 -- хранят значения a,b,c и d в указанном порядке
    ; t0 -- хранит старшую часть a*c (потом a*d)
    ; t1 -- хранит младшую часть a*c (потом a*d)
    ; t2 -- хранит старшую часть b*d (потом b*c)
    ; t3 -- хранит младшую часть b*d (потом b*c)

end:
                                   /                                /              / halt                     ; Останов.

; Функция чтения значений со входа в регистры a0-a3
read_args:
                                   /                                / lw a0, 0(s1) /                          ; a0 <- a
                                   /                                / lw a1, 0(s1) /                          ; a1 <- b
                                   /                                / lw a2, 0(s1) /                          ; a2 <- с
                                   /                                / lw a3, 0(s1) /                          ; a3 <- d

    ; Возврат из процедуры
                                   /                                /              / jalr zero, ra, 0         ; pc <- ra + 0, аналог старой инструкции jr

; Функция умножения двух комплексных чисел, получающая на вход четыре аргумента
; и выводящая вещественную и мнимую часть результата
complex_multiply:
    ; Через регистры A0-A3 получили аргументы

    ; Сохраняем callee-saved регистры на стек
    addi sp, sp, -4                /                                /              /
                                   /                                / sw s6, 0(sp) /

    addi sp, sp, -4                /                                /              /
                                   /                                / sw s7, 0(sp) /

    ; Вычисление вещественной части комплексного числа
    mulh t0, a0, a2                / mul t1, a0, a2                 /              /                          ; Записываем в t0 - старшую часть ac, в t1 - младшую часть ac
    mulh t2, a1, a3                / mul t3, a1, a3                 /              /                          ; Записываем в t2 - старшую часть bd, в t3 - младшую часть bd

    ; real = ac - bd; t0 - старшие 32 бита комплексной части, s6 - младшие 32 бита
    sub t0, t0, t2                 / sub s6, t1, t3                 /              /
                                   /                                /              / bgeu t1, t3, real_check  ; Заём из старшей части нужен только, если вычитаемая младшая часть оказалась больше уменьшаемого

    ; Иначе - произошёл заём
    addi t0, t0, -1                /                                /              /                          ; Учитываем его в старшей части real

real_check:
    sra t4, s6, s4                 /                                /              /                          ; Та же самая проверка старших 32 бит, что и в imag_check
                                   /                                /              / bne t4, t0, print_error

    ; Вычисление комплексной части вещественного числа
    mulh t0, a0, a3                / mul t1, a0, a3                 /              /                          ; Записываем в t0 - старшую часть ad, в t1 - младшую часть ad
    mulh t2, a1, a2                / mul t3, a1, a2                 /              /                          ; Записываем в t2 - старшую часть bc, в t3 - младшую часть bc

    ; imag = ad + bc; t0 - старшие 32 бита комплексной части, s7 - младшие 32 бита
    add t0, t0, t2                 / add s7, t1, t3                 /              /
                                   /                                /              / bgeu s7, t1, imag_check  ; Перенос может быть тогда, когда итоговая младшая часть < любой из двух младших просуммированных частей

    ; Иначе - был перенос из младшей части
    addi t0, t0, 1                 /                                /              /

imag_check:
    sra t4, s7, s4                 /                                /              /                          ; Берём первый старший бит младшей части imag, причём расширяя знак, то есть 1 -> 0xFFFFFFFF, а 0 -> 0x00000000
                                   /                                /              / bne t4, t0, print_error  ; Если значение t4 не равно значению в старшей части imag - сто процентов вылезло переполнение

    ; Если всё успешно, переходим к выводу полученных значений
                                   /                                / sw s6, 0(s2) /
                                   /                                / sw s7, 0(s2) / j end_complex_multiply

print_error:
                                   /                                / sw s3, 0(s2) /                          ; Выводим значение error_value

end_complex_multiply:
    ; Восстанавливаем callee-saved регистры
                                   /                                / lw s7, 0(sp) /
    addi sp, sp, 4                 /                                /              /

                                   /                                / lw s6, 0(sp) /
    addi sp, sp, 4                 /                                /              /

    ; Возврат из функции: в регистр zero все записи игнорируются, поэтому используем его, так как результат не важен
                                   /                                /              / jalr zero, ra, 0         ; pc <- ra + 0